# config/columns/columns_config.py
"""
Конфигурация колонок для загрузки данных
"""

# Колонки для удаления
COLUMNS_TO_DROP = [
    "Номер документа",
    "Наименование груза",
    "Дор отпр",
    "Код станц отпр РФ",
    "Грузоотправитель полное наименование",
    "Грузоотправитель-ОКПО",
    "Дор наз",
    "Код станц назн РФ",
    "Грузополучатель полное наименование",
    "Грузополучатель-ОКПО",
    "Арендатор",
    "Объем*перевозок (тн)",
    "Провозная*плата",
    "КЛАСС ГРУЗА",
    "Код станц отпр СНГ",
    "Код станц назн СНГ",
    "Категория отпр",
    "Подрод вагона",
    "Тип вагона",
    "Вагоно-км",
    "Вид перевозки",
    "Тоннажность",
    "Модель вагона",
    "Тип парка",
    "Оператор",
    "Собственник по ЕГРПО",
    "Плательщик",
    "Тип контейнера",
    "Станц отпр СНГ",
    "Станц назн СНГ",
    "Номер вагона",
    "Грузоотправитель краткое наименование",
    "Грузоотправитель-ИНН",
    "Грузополучатель краткое наименование",
    "Грузополучатель-ИНН"
]

# Колонки для сохранения
COLUMNS_TO_KEEP = [
    "Номер контейнера",
    "Дата отправления",
    "Код груза",
    "Гос отпр",
    "Субъект федерации отп",
    "Станц отпр РФ",
    "Гос наз",
    "Субъект федерации наз",
    "Станц назн РФ",
    "Станц назн СНГ"
]

# Маппинг для БД
COLUMN_MAPPING = {
    "Номер контейнера": "container_number",
    "Дата отправления": "departure_date",
    "Код груза": "cargo_code",
    "Гос отпр": "departure_country",
    "Субъект федерации отп": "departure_region",
    "Станц отпр РФ": "departure_station",
    "Гос наз": "destination_country",
    "Субъект федерации наз": "destination_region",
    "Станц назн РФ": "destination_station",
    "Станц назн СНГ": "destination_station_sng"
}